app/views/profiles/liked_comments.html.erb

SELECT "like_comments".* FROM "like_comments" WHERE (user_id = 5) ORDER BY "like_comments"."created_at" DESC
SELECT COUNT(*) FROM "like_comments" WHERE "like_comments"."comment_id" = $1  [["comment_id", 4]]
---

    Likes: <%= comment.liked_comments.count %>