app/views/profiles/user_comments.html.erb


    Likes: <%= comment.liked_comments.count %>
---
SELECT "comments".* FROM "comments" WHERE (user_id = 6)
SELECT COUNT(*) FROM "like_comments" WHERE "like_comments"."comment_id" = $1  [["comment_id", 4]]