app/views/shared/_affairs_form.html.erb

    <% end %>
    <% if !current_user.blocked_users.include?(target) %>
---
SELECT  1 AS one FROM "users" INNER JOIN "friends" ON "users"."id" = "friends"."friend_id" WHERE "friends"."user_id" = $1 AND "users"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 6], ["LIMIT", 1]]