app/views/shared/_liking_form.html.erb

SELECT  1 AS one FROM "like_comments" WHERE (user_id = 5 AND comment_id = 4) LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "like_posts" WHERE (user_id = 5 AND post_id = 3) LIMIT $1  [["LIMIT", 1]]
---
<% if current_user != target.user %>
    <% if (target_name == "post" && LikePost.where("user_id = ? AND post_id = ?", current_user.id, target.id).exists?) || (target_name == "comment" && LikeComment.where("user_id = ? AND comment_id = ?", current_user.id, target.id).exists?)  %>