app/views/shared/_view_users.html.erb

SELECT  "like_posts".* FROM "like_posts" WHERE "like_posts"."user_id" = $1 ORDER BY "like_posts"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "like_posts" WHERE "like_posts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
    <br />
    <% if user.posts.exists? %>

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
        <br />
        <%= link_to user.posts.last.title, post_path(user.posts.last) %>
        <br />
        <%= model_date(user.posts.last) %>

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 ORDER BY "comments"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
    <% end %>
    <% if user.comments.exists?  %>

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 ORDER BY "comments"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <br />
        <%= link_to user.comments.last.content, post_path(user.comments.last.post) %>
        <br />
        <%= model_date(user.comments.last) %>

SELECT  1 AS one FROM "like_posts" WHERE "like_posts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT  "like_posts".* FROM "like_posts" WHERE "like_posts"."user_id" = $1 ORDER BY "like_posts"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <% end %>
    <% if user.liked_posts.exists? %>
        <% post = Post.find(user.liked_posts.last.post_id) %>

SELECT  "like_posts".* FROM "like_posts" WHERE "like_posts"."user_id" = $1 ORDER BY "like_posts"."id" DESC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
        <br />
        <%= model_date(user.liked_posts.last) %>

SELECT  1 AS one FROM "like_comments" WHERE "like_comments"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
    <% end %>
    <% if user.liked_comments.exists? %>

SELECT "friends".* FROM "friends" WHERE (user_id = 5 OR friend_id = 5) ORDER BY "friends"."created_at" DESC
---
    <%= link_to 'View Profile', "/profiles/#{user.id}" %>
    <% if user.added_friends.exists? || user.added_by_friends.exists? %>