app/helpers/application_helper.rb

INSERT INTO "like_posts" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["post_id", 3], ["created_at", "2020-04-12 15:16:41.906948"], ["updated_at", "2020-04-12 15:16:41.906948"]]
---
    def like_something(like_what) #accepts string argument.
        user_id = params[:like_post][:user_id]
        post_id = params[:like_post]["#{like_what}_id".to_sym]
        class_name = "Like#{like_what.capitalize}".constantize
        redirect_back(fallback_location: root_url) unless class_name.where("user_id = ? AND post_id = ?", user_id, post_id).exists?
        class_name.new(user_id: user_id, post_id: post_id)
        if class_name.save

SELECT "friends".* FROM "friends" WHERE (user_id = 5 OR friend_id = 5) ORDER BY "friends"."created_at" DESC
---
    def get_friends(user)
        Friend.where("user_id = ? OR friend_id = ?", user.id)
              .order(desc: :created_at)
              .map { |f| f.user_id != user.id ? User.find(f.user_id) : User.find(f.friend_id) }