app/views/posts/show.html.erb

    <% end %>
    <p>Likes: <%= @post.liked_posts.count %></p>
---
SELECT COUNT(*) FROM "like_posts" WHERE "like_posts"."post_id" = $1  [["post_id", 3]]


Likes: <%= @post.liked_posts.count %> |
---
SELECT COUNT(*) FROM "like_posts" WHERE "like_posts"."post_id" = $1  [["post_id", 3]]

<section id="comment-section">
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]

            <% end %>
            <p>Likes: <%= comment.liked_comments.count %></p>
---
SELECT COUNT(*) FROM "like_comments" WHERE "like_comments"."comment_id" = $1  [["comment_id", 4]]