app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Yeehaaw"], ["user_id", 5], ["post_id", 1], ["created_at", "2020-04-11 15:30:10.653177"], ["updated_at", "2020-04-11 15:30:10.653177"]]