app/controllers/delete_user_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def destroy
        user = User.find(params[:id]).destroy