app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First Post"], ["content", "First post of Social Media App!"], ["user_id", 5], ["created_at", "2020-04-11 15:15:37.951648"], ["updated_at", "2020-04-11 15:15:37.951648"]]

  def find_post
    Post.find(params[:id])
---
SELECT "like_posts".* FROM "like_posts" WHERE "like_posts"."post_id" = $1  [["post_id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]