app/controllers/profiles_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "like_posts".* FROM "like_posts" WHERE (user_id = 5) ORDER BY "like_posts"."created_at" DESC
---
    def user_posts
        @posts = Post.where("user_id = ?", @user.id)

SELECT "like_comments".* FROM "like_comments" WHERE (user_id = 5) ORDER BY "like_comments"."created_at" DESC
---
    def user_comments
        @comments = Comment.where("user_id = ?", @user.id)