app/controllers/profiles_controller.rb

    def liked_posts
        @posts = LikePost.where("user_id = ?", @user.id).order(created_at: :desc)
                 .map { |p| Post.find(p.post_id) }
---
SELECT "like_posts".* FROM "like_posts" WHERE (user_id = 5) ORDER BY "like_posts"."created_at" DESC

    def liked_comments
        @comments = LikeComment.where("user_id = ?", @user.id).order(created_at: :desc)
                    .map { |c| Comment.find(c.comment_id) }
---
SELECT "like_comments".* FROM "like_comments" WHERE (user_id = 5) ORDER BY "like_comments"."created_at" DESC