app/controllers/profiles_controller.rb

    def friends
        @title = "Friends"
        @users = Friend.where("user_id = ? OR friend_id = ?", @user.id)
                .order(desc: :created_at)
                .map { |f| f.user_id != @user.id ? User.find(f.user_id) : User.find(f.friend_id) }
---
SELECT "friends".* FROM "friends" WHERE (user_id = 5 OR friend_id = 5) ORDER BY "friends"."created_at" DESC