app/controllers/relationships_controller.rb

    def create
        user_id = params[:befriend][:user_id]
        friend_id = params[:befriend][:friend_id]
        if Friend.where("user_id = ? AND friend_id = ?", friend_id, user_id).exists? || Friend.where("user_id = ? AND friend_id = ?", user_id, friend_id).exists?
            redirect_back(fallback_location: root_url)
        elsif User.find(user_id).blockers.include?(User.find(friend_id))
            flash[:error] = "Error! You're blocked by this user."
        elsif User.find(friend_id).blockers.include?(User.find(user_id))
            flash[:error] = "Error! You can't befriend user you've blocked."
        elsif Friend.new(user_id: user_id, friend_id: friend_id).save
---
SELECT  1 AS one FROM "friends" WHERE (user_id = '6' AND friend_id = '5') LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "friends" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["friend_id", 6], ["created_at", "2020-04-13 14:05:34.607268"], ["updated_at", "2020-04-13 14:05:34.607268"]]