app/controllers/static_pages_controller.rb

SELECT "posts".* FROM "posts" WHERE (created_at < '2020-04-07 10:32:39.764346')
SELECT COUNT(*) FROM "like_posts" WHERE "like_posts"."post_id" = $1  [["post_id", 1]]
---
  def trending
    @posts = Post.where("created_at < ?", 3.hours.ago)
             .sort_by { |p| p.liked_posts.count }.reverse.take(25)

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "like_posts" WHERE "like_posts"."post_id" = $1  [["post_id", 1]]
---
  def top
    @posts = Post.all.sort_by { |p| p.liked_posts.count }
             .reverse.take(25)